event-platform/loadtest/allure-results/b4430969-5c5e-4251-83bb-4edc3ade5708-attachment.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6_10k_500kb.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_rate_load: 35.00 iterations/s for 1m0s (maxVUs: 50-100, gracefulStop: 30s)


running (0m00.5s), 020/050 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   1% ] 020/050 VUs  0m00.5s/1m0s  35.00 iters/s

running (0m01.5s), 052/052 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   3% ] 052/052 VUs  0m01.5s/1m0s  35.00 iters/s

running (0m02.5s), 068/068 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   4% ] 068/068 VUs  0m02.5s/1m0s  35.00 iters/s

running (0m03.5s), 083/083 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   6% ] 083/083 VUs  0m03.5s/1m0s  35.00 iters/s
time="2026-08-08T10:23:55Z" level=warning msg="Insufficient VUs, reached 100 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=constant_rate_load

running (0m04.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   8% ] 100/100 VUs  0m04.5s/1m0s  35.00 iters/s

running (0m05.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [   9% ] 100/100 VUs  0m05.5s/1m0s  35.00 iters/s

running (0m06.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [  11% ] 100/100 VUs  0m06.5s/1m0s  35.00 iters/s

running (0m07.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [  13% ] 100/100 VUs  0m07.5s/1m0s  35.00 iters/s

running (0m08.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [  14% ] 100/100 VUs  0m08.5s/1m0s  35.00 iters/s

running (0m09.5s), 100/100 VUs, 0 complete and 0 interrupted iterations
constant_rate_load   [  16% ] 100/100 VUs  0m09.5s/1m0s  35.00 iters/s

running (0m10.5s), 019/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  18% ] 019/100 VUs  0m10.5s/1m0s  35.00 iters/s

running (0m11.5s), 054/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  19% ] 054/100 VUs  0m11.5s/1m0s  35.00 iters/s

running (0m12.5s), 089/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  21% ] 089/100 VUs  0m12.5s/1m0s  35.00 iters/s

running (0m13.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  23% ] 100/100 VUs  0m13.5s/1m0s  35.00 iters/s

running (0m14.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  24% ] 100/100 VUs  0m14.5s/1m0s  35.00 iters/s

running (0m15.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  26% ] 100/100 VUs  0m15.5s/1m0s  35.00 iters/s

running (0m16.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  28% ] 100/100 VUs  0m16.5s/1m0s  35.00 iters/s

running (0m17.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  29% ] 100/100 VUs  0m17.5s/1m0s  35.00 iters/s

running (0m18.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  31% ] 100/100 VUs  0m18.5s/1m0s  35.00 iters/s

running (0m19.5s), 100/100 VUs, 100 complete and 0 interrupted iterations
constant_rate_load   [  33% ] 100/100 VUs  0m19.5s/1m0s  35.00 iters/s

running (0m20.5s), 014/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  34% ] 014/100 VUs  0m20.5s/1m0s  35.00 iters/s

running (0m21.5s), 049/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  36% ] 049/100 VUs  0m21.5s/1m0s  35.00 iters/s

running (0m22.5s), 084/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  38% ] 084/100 VUs  0m22.5s/1m0s  35.00 iters/s

running (0m23.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  39% ] 100/100 VUs  0m23.5s/1m0s  35.00 iters/s

running (0m24.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  41% ] 100/100 VUs  0m24.5s/1m0s  35.00 iters/s

running (0m25.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  43% ] 100/100 VUs  0m25.5s/1m0s  35.00 iters/s

running (0m26.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  44% ] 100/100 VUs  0m26.5s/1m0s  35.00 iters/s

running (0m27.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  46% ] 100/100 VUs  0m27.5s/1m0s  35.00 iters/s

running (0m28.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  48% ] 100/100 VUs  0m28.5s/1m0s  35.00 iters/s

running (0m29.5s), 100/100 VUs, 200 complete and 0 interrupted iterations
constant_rate_load   [  49% ] 100/100 VUs  0m29.5s/1m0s  35.00 iters/s

running (0m30.5s), 013/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  51% ] 013/100 VUs  0m30.5s/1m0s  35.00 iters/s

running (0m31.5s), 048/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  53% ] 048/100 VUs  0m31.5s/1m0s  35.00 iters/s

running (0m32.5s), 083/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  54% ] 083/100 VUs  0m32.5s/1m0s  35.00 iters/s

running (0m33.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  56% ] 100/100 VUs  0m33.5s/1m0s  35.00 iters/s

running (0m34.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  58% ] 100/100 VUs  0m34.5s/1m0s  35.00 iters/s

running (0m35.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  59% ] 100/100 VUs  0m35.5s/1m0s  35.00 iters/s

running (0m36.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  61% ] 100/100 VUs  0m36.5s/1m0s  35.00 iters/s

running (0m37.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  63% ] 100/100 VUs  0m37.5s/1m0s  35.00 iters/s

running (0m38.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  64% ] 100/100 VUs  0m38.5s/1m0s  35.00 iters/s

running (0m39.5s), 100/100 VUs, 300 complete and 0 interrupted iterations
constant_rate_load   [  66% ] 100/100 VUs  0m39.5s/1m0s  35.00 iters/s

running (0m40.5s), 009/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  68% ] 009/100 VUs  0m40.5s/1m0s  35.00 iters/s

running (0m41.5s), 044/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  69% ] 044/100 VUs  0m41.5s/1m0s  35.00 iters/s

running (0m42.5s), 079/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  71% ] 079/100 VUs  0m42.5s/1m0s  35.00 iters/s

running (0m43.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  73% ] 100/100 VUs  0m43.5s/1m0s  35.00 iters/s

running (0m44.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  74% ] 100/100 VUs  0m44.5s/1m0s  35.00 iters/s

running (0m45.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  76% ] 100/100 VUs  0m45.5s/1m0s  35.00 iters/s

running (0m46.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  78% ] 100/100 VUs  0m46.5s/1m0s  35.00 iters/s

running (0m47.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  79% ] 100/100 VUs  0m47.5s/1m0s  35.00 iters/s

running (0m48.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  81% ] 100/100 VUs  0m48.5s/1m0s  35.00 iters/s

running (0m49.5s), 100/100 VUs, 400 complete and 0 interrupted iterations
constant_rate_load   [  83% ] 100/100 VUs  0m49.5s/1m0s  35.00 iters/s

running (0m50.6s), 005/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  84% ] 005/100 VUs  0m50.6s/1m0s  35.00 iters/s

running (0m51.5s), 040/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  86% ] 040/100 VUs  0m51.5s/1m0s  35.00 iters/s

running (0m52.5s), 075/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  88% ] 075/100 VUs  0m52.5s/1m0s  35.00 iters/s

running (0m53.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  89% ] 100/100 VUs  0m53.5s/1m0s  35.00 iters/s

running (0m54.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  91% ] 100/100 VUs  0m54.5s/1m0s  35.00 iters/s

running (0m55.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  93% ] 100/100 VUs  0m55.5s/1m0s  35.00 iters/s

running (0m56.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  94% ] 100/100 VUs  0m56.5s/1m0s  35.00 iters/s

running (0m57.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  96% ] 100/100 VUs  0m57.5s/1m0s  35.00 iters/s

running (0m58.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  98% ] 100/100 VUs  0m58.5s/1m0s  35.00 iters/s

running (0m59.5s), 100/100 VUs, 500 complete and 0 interrupted iterations
constant_rate_load   [  99% ] 100/100 VUs  0m59.5s/1m0s  35.00 iters/s

running (1m00.6s), 045/100 VUs, 555 complete and 0 interrupted iterations
constant_rate_load ↓ [ 100% ] 100/100 VUs  1m0s  35.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=9.93s

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 600     9.906852/s
    checks_succeeded...: 0.00%   0 out of 600
    checks_failed......: 100.00% 600 out of 600

    ✗ status is 202
      ↳  0% — ✓ 0 / ✗ 600

    CUSTOM
    failed_ingestions....: 600     9.906852/s

    HTTP
    http_req_duration....: avg=8.58s min=5.46s med=8.66s max=10.04s p(90)=9.78s p(95)=9.93s
    http_req_failed......: 100.00% 600 out of 600
    http_reqs............: 600     9.906852/s

    EXECUTION
    dropped_iterations...: 1500    24.76713/s
    iteration_duration...: avg=8.6s  min=5.49s med=8.68s max=10.11s p(90)=9.8s  p(95)=9.94s
    iterations...........: 600     9.906852/s
    vus..................: 27      min=5          max=100
    vus_max..............: 100     min=50         max=100

    NETWORK
    data_received........: 109 kB  1.8 kB/s
    data_sent............: 307 MB  5.1 MB/s



running (1m00.6s), 000/100 VUs, 600 complete and 0 interrupted iterations
constant_rate_load ✓ [ 100% ] 000/100 VUs  1m0s  35.00 iters/s
time="2026-08-08T10:24:52Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"